---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.PipingFriction
source: html/2a54035c-08ff-eb89-7886-5f13d1cd9211.htm
---
# Autodesk.Revit.DB.SpecTypeId.PipingFriction Property

Friction, in discipline Piping.

## Syntax (C#)
```csharp
public static ForgeTypeId PipingFriction { get; }
```